Tekla Open API Reference for Tekla Structures 2025
RebarLengthAdjustmentDataNullable Properties
The RebarLengthAdjustmentDataNullable type exposes the following members.
Properties
Name | Description
AdjustmentLength
 Gets or sets the adjustment length.
AdjustmentType
 Gets or sets the adjustment type.
Top
See Also
Reference
RebarLengthAdjustmentDataNullable Class
Tekla.Structures.Model Namespace